using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
//using System.Threading.Tasks;

namespace adminka
{
    class PriceInWords
    {
        public string SummaPropis(string summ, string currency)
        {
            string s = "";

            if (summ.Length == 5)
            {
                if (summ[0] == '2' && summ[1] == '9')
                    s = "Двадцать девять тысячи";
                if (summ[0] == '2' && summ[1] == '8')
                    s = "Двадцать восемь тысяч";
                if (summ[0] == '2' && summ[1] == '7')
                    s = "Двадцать семь тысяч";
                if (summ[0] == '2' && summ[1] == '6')
                    s = "Двадцать шесть тысячи";
                if (summ[0] == '2' && summ[1] == '5')
                    s = "Двадцать пять тысяч";
                if (summ[0] == '2' && summ[1] == '4')
                    s = "Двадцать четыре тысячи";
                if (summ[0] == '2' && summ[1] == '3')
                    s = "Двадцать три тысячи";
                if (summ[0] == '2' && summ[1] == '2')
                    s = "Двадцать две тысячи";
                if (summ[0] == '2' && summ[1] == '1')
                    s = "Двадцать одна тысяча";
                if (summ[0] == '2' && summ[1] == '0')
                    s = "Двадцать тысяч";
                if (summ[0] == '1' && summ[1] == '9')
                    s = "Девятнадцать тысяч";
                if (summ[0] == '1' && summ[1] == '8')
                    s = "Восемнадцать тысяч";
                if (summ[0] == '1' && summ[1] == '7')
                    s = "Семнадцать тысяч";
                if (summ[0] == '1' && summ[1] == '6')
                    s = "Шестнадцать тысяч";
                if (summ[0] == '1' && summ[1] == '5')
                    s = "Пятнадцать тысяч";
                if (summ[0] == '1' && summ[1] == '4')
                    s = "Четырнадцать тысяч";
                if (summ[0] == '1' && summ[1] == '3')
                    s = "Тринадцать тысяч";
                if (summ[0] == '1' && summ[1] == '2')
                    s = "Двенадцать тысяч";
                if (summ[0] == '1' && summ[1] == '1')
                    s = "Одиннадцать тысяч";

                if (summ[2] == '1')
                    s += " сто ";
                if (summ[2] == '2')
                    s += " двести ";
                if (summ[2] == '3')
                    s += " триста ";
                if (summ[2] == '4')
                    s += " четыреста ";
                if (summ[2] == '5')
                    s += " пятьсот ";
                if (summ[2] == '6')
                    s += " шестьсот ";
                if (summ[2] == '7')
                    s += " семьсот ";
                if (summ[2] == '8')
                    s += " восемьсот ";
                if (summ[2] == '9')
                    s += " девятьсот ";
            }
            if (summ.Length == 4)
            {
                if (summ[0] == '1')
                    s = "Тысяча";
                if (summ[0] == '2')
                    s = "Две тысячи";
                if (summ[0] == '3')
                    s = "Три тысячи";
                if (summ[0] == '4')
                    s = "Четыре тысячи";
                if (summ[0] == '5')
                    s = "Пять тысяч";
                if (summ[0] == '6')
                    s = "Шесть тысяч";
                if (summ[0] == '7')
                    s = "Семь тысяч";
                if (summ[0] == '8')
                    s = "Восемь тысяч";

                if (summ[1] == '1')
                    s += " сто ";
                if (summ[1] == '2')
                    s += " двести ";
                if (summ[1] == '3')
                    s += " триста ";
                if (summ[1] == '4')
                    s += " четыреста ";
                if (summ[1] == '5')
                    s += " пятьсот ";
                if (summ[1] == '6')
                    s += " шестьсот ";
                if (summ[1] == '7')
                    s += " семьсот ";
                if (summ[1] == '8')
                    s += " восемьсот ";
                if (summ[1] == '9')
                    s += " девятьсот ";


                if (summ[2] == '1')
                    s += " десять ";
                if (summ[2] == '2')
                    s += " двадцать ";
                if (summ[2] == '3')
                    s += " тридцать ";
                if (summ[2] == '4')
                    s += " сорок ";
                if (summ[2] == '5')
                    s += " пятьдесят ";
                if (summ[2] == '6')
                    s += " шестьдесят ";
                if (summ[2] == '7')
                    s += " семьдесят ";
                if (summ[2] == '8')
                    s += " восемьдесят ";
                if (summ[2] == '9')
                    s += " девяносто ";
            }

            s += " " + currency;
            return s;
        }
    }
}
